<!DOCTYPE html>
<html>


<head>


<link rel="shortcut icon" href="../images/mrC.png">
<title>Definiciones matemáticas | Friki Cueva</title>
<meta name="description" content="Website about mahts, programming, theoretical physics and much more." />


<script type="text/javascript" src="../mijquery.js"></script>
<script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
<script type="text/javascript" src="../change-theme.js"></script>


<link href="../estilos.css" rel="StyleSheet" type="text/css"/>
<!--Poner mas cosas-->


</head>



<body>
<a name="arriba"></a>

<!--Cabecera de pagina-->
<header>
<h1 id="titulo">La Friki Cueva</h1>
<p>Wellcome to the <a href="https://droidroar369.github.io/friki-cueva/" title="Main Page">Friki Cueva</a>, a site about mathematics, programming, theoretical physics and much more!!! Here i will be posting demonstrations, theorems, and some applications in physics, also i write about programming and a lot of topics more. I promise that you'll enjoy the journey!!!</p>
<p><b>PD: you should enable JavaScript to see the mathematical equations and the animations.</b></p>
</header>


<input type="button" value="Oscuro/claro" onclick="change_theme()">


<!--Constantes matematicas-->
<div id="constantes">
<h2>Constantes famosas</h2>
<ul>
<li>$$\pi=3.1415926535897932384626...$$</li>
<li>$$e=2.7182818284590454323...$$</li>
<li>$$\phi=1.618033988...$$</li>
</ul>
</div>


<!--Cueva del aprendizaje-->
<article>


<!--Menu de navegacion-->
<nav>
<h2>Lista de temas selectos</h2>

<ul>
<li><b>Matem&aacute;ticas 1: lógica y demostraciones</b></li>
<ol>
<li><a href="#arriba" title="Principios de básicos" rel="first">Principios de Matem&aacute;ticas: abstracci&oacute;n, simbolizaci&oacute;n y definiciones</a></li>
</ol>


<li><b>Mis demostraciones</b></li>
  <ul>
    <li><a href="../proofs/double-rotational-proof.html">Identidad del doble rotacional</a></li>
  </ul>


<li><b>Álgebra</b></li>
<ul><li>Pr&oacute;ximamente...</li></ul>


<li><b>Cálculo</b></li>
<ul><li>Pr&oacute;ximamente...</li></ul>


</ul>
</nav>



<h1>Matem&aacute;ticas</h1>
<section>
<h2>Introducci&oacute;n</h2>
<p>La matem&aacute;tica es la disciplina que estudia las entidades abstractas mediante el razonamiento.</p>
<p>Una entidad abstracta es el resultado de abstraer cualquier cosa (objetos, procesos, situaciones, acciones). Abstraer es aislar una propiedad espec&iacute;fica de cualquier cosa, es la forma m&aacute;s b&aacute;sica y simple que puede tener una estructura. A pesar de que algo abstracto es lo m&aacute;s simple posible, el proceso de abstraer no siempre es tan f&aacute;cil. 
Cualquier cosa que exista o podamos imaginar se puede abstraer para formar una entidad abstracta. Algunos ejemplos de estas entidades son: los n&uacute;meros, las figuras geom&eacute;tricas, los conjuntos, los colores, etc.</p>
<p>En las matem&aacute;ticas siempre tratamos con estas entidades abstractas.</p>

<h3>La simbolizaci&oacute;n</h3>
<p>Ya vimos que lo abstracto es la forma de pensamiento m&aacute;s simple que puede existir. Por tanto, lo abstracto no es tangible, incluso en la imaginaci&oacute;n es dif&iacute;cil trabajar con cosas abstractas. Por ello, se invent&oacute; la simbolizaci&oacute;n, que consiste en usar <b>s&iacute;mbolos</b> para representar cada idea abstracta. Los s&iacute;mbolos son grafos o trazos que representan algo, por ejemplo: 1,2,3,4,5. Esos trazos que nos ense&ntilde;aron desde el kinder NO SON N&Uacute;MEROS, S&Oacute;LO SON SU REPRESENTACI&Oacute;N. As&iacute; que debo informarte que te han mentido toda tu vida, pues esas cosas s&oacute;lo son un trazo que representan ideas abstractas, e incluso podr&iacute;s inventar tus propios grafos para representarlas. Si me preguntan qu&eacute; es n&uacute;mero, simplemente les dir&eacute; que es la abstracci&oacute;n de nuestra idea de contar y medir. Evidentemente, tratar con lo que intuitivamente llamamos "contar" desde el punto de vista formal y riguroso de la matem&aacute;tica es muy complicado. Para que me creas preg&uacute;ntate, &iquest;qu&eacute; es realmente un n&uacute;mero? No vale la respuesta <i>"Son entidades como 1, 2, 3..., 2.785, &pi;, 2/3 y todos los dem&aacute;s"</i> ya que con ello no estamos contestando la pregunta, simplemente estamos dando ejemplos de n&uacute;meros.</p>

<p>De tal forma, un n&uacute;mero es totalmente abstracto, no se puede visualizar ni dibujar, aunque podemos inventar un s&iacute;mbolo para escribirlo. Como has de suponer, los n&uacute;meros son los mismos aqu&iacute; y en China, aunque se escriban diferente. En la matem&aacute;tica, la simbolizaci&oacute;n  es tan esencial como la abstracci&oacute;n. Todo lo que manejaremos ser&aacute;n s&iacute;mbolos, ya que es mucho m&aacute;s c&oacute;modo que trabajar con las abstracciones. Sin embargo, siempre debemos tener en mente la esencia de lo que estamos haciendo y no dejarnos guiar ciegamente por los s&iacute;mbolos. Para que se entienda: la simbolizaci&oacute;n s&oacute;lo nos ayuda a simplificar el trabajo, pero no por ello vamos a evitarlo.</p>

<p>Adem&aacute;s, los s&iacute;mbolos nos permiten comunicar nuestras ideas a otras personas. Como analog&iacute;a piensen en nuestro alfabeto y las palabras formadas por &eacute;ste: si bien podemos pensar en conceptos puros o abstractos como el verbo "hacer", el verbo "ser", el adjetivo "rojo", el sustantivo "palabra", etc., nosotros lo que comunicamos y percibimos son las combinaciones de letras formadas por el alfabeto. Note que "palabra" no tiene sentido si no se le asocia un significado y no se especifica qu&eacute; hace cada letra, as&iacute; que no se deje guiar simplemente por los s&iacute;mbolos, recuerde que &eacute;stos no tienen sentido sin una idea detr&aacute;s de ellos y por tanto, lo que usted debe pensar es en dicha idea, no en su representaci&oacute;n gr&aacute;fica.</p>
<!--Frase graciosa: Hab&iacute;a una vez un sujeto tan, pero tan tonto, que cuando le preguntaron qu&eacute; es sumar &eacute;l respondi&oacute; que es poner un signo de m&aacute;s entre 2 n&uacute;meros -->
<!-- Poner ejercicios dificiles para los lectores ;) -->
</section>
<section>
<h2>Poni&eacute;ndonos de acuerdo</h2>
<h3>La definici&oacute;n</h3>
<p>Anteriormente ya vimos que la matem&aacute;tica trata sobre la abstracci&oacute;n y para facilitarnos la vida usamos s&iacute;mbolos. Sin embargo, eso no basta para poder hacer matem&aacute;ticas. Si bien a partir de ahora trataremos de estudiar las propiedades de conceptos totalmente abstractos, dichos conceptos ser&aacute;n comunes en muchas &aacute;reas de la matem&aacute;tica e incluso en otras disciplinas tales como la F&iacute;sica, la Qu&iacute;mica y la Filosof&iacute;a. Por ello, nos conviene delimitar cada concepto importante para identificarlo cada vez que lo utilicemos, y sobre todo, distinguirlo de todos los dem&aacute;s conceptos. Por ejemplo, cuando nos referimos al fen&oacute;meno natural en el que cae agua del cielo, lo llamamos "lluvia" para evitar mencionar "fen&oacute;meno en el que cae agua del cielo". Ser&iacute;a bastante inc&oacute;modo decir todo eso, &iquest;verdad? Adem&aacute;s, estamos creando un nuevo concepto y con ello lo distinguimos de otras ideas: sabemos que las cosas caen y tambi&eacute;n que en ocasiones cae agua del cielo. &iquest;Por qu&eacute; no crear o <i>definir</i> un nuevo concepto en el que el agua caiga del cielo? Cuando nos referimos a "lluvia", s&oacute;lo consideramos agua cayendo del cielo, discriminando as&iacute; otras situaciones como "agua cayendo de la regadera" u "objeto cayendo desde la mesa".</p>

<p>Sabiendo que la matem&aacute;tica se compone de conceptos abstractos, a una agrupaci&oacute;n o delimitaci&oacute;n de &eacute;stos la llamaremos <b>definici&oacute;n</b>. Tal delimitaci&oacute;n es en s&iacute; misma un concepto nuevo, y diremos que ocurre tal concepto cuando se cumplan todas las delimitaciones que le pusimos. En el ejemplo de la lluvia, decimos que est&aacute; lloviendo cuando cae agua (s&oacute;lo agua, cualquier otro objeto que se caiga no entra en los t&eacute;rminos de "lluvia") y &eacute;sta cae del cielo (no vale si el agua cae de la regadera del ba&ntilde;o o si tu vecino te tir&oacute; una cubeta encima).</p>

<p>Pensando en todo lo anterior haremos nuestra primera definici&oacute;n. Aunque suene redundante e il&oacute;gico definiremos "definici&oacute;n". En este caso, por "definici&oacute;n" entenderemos lo que entiende un matem&aacute;tico, sin embargo, la idea es la misma que la de una definici&oacute;n en nuestro lenguaje cotidiano. Como ejercicio al lector intente dar su propia definici&oacute;n de "definici&oacute;n", entendiendo con ello lo mismo que en el lenguaje ordinario s&oacute;lo que ahora aplicado en matem&aacute;ticas.</p>

<div class="definition">
<b><i>Definici&oacute;n (matem&aacute;tica)</i></b><br>
<p>En la matem&aacute;tica, una definici&oacute;n es una delimitaci&oacute;n hecha a alg&uacute;n conjunto de conceptos con el fin de distinguirlos de otros conceptos. Dicha delimitaci&oacute;n es en s&iacute; misma un concepto y debe ser compatible con los dem&aacute;s conceptos del contexto estudiado.</p> 
</div>
<p>Medita muy bien la "definici&oacute;n" anterior (&iquest;por qu&eacute; lo que acabamos de establecer no es una definición formal? V&eacute;ase ejercicio 2) pues es uno de los cimientos b&aacute;sicos de la matem&aacute;tica. Ahora, analic&eacute;mosla muy bien. La supuesta definici&oacute;n nos menciona <i>"delimitaci&oacute;n hecha a alg&uacute;n conjunto de conceptos"</i>. Por "concepto", entendemos lo que en nuestro lenguaje com&uacute;n significa: una idea , una representaci&oacute;n mental o una abstracci&oacute;n de algo. Sin embargo, para dar una definici&oacute;n n&oacute;tese que debe haber otros conceptos ya establecidos, pues de tal modo no tendr&iacute;a sentido hablar sobre <i>"un conjunto de conceptos"</i>, es decir, &iquest;c&oacute;mo hablar de algo que no existe? Recuerda que estamos construyendo una nueva idea, no podemos construir de la nada, &iquest;verdad?</p>

<p>Adem&aacute;s de todo ello, las definiciones deben ser conceptos que s&iacute; puedan existir, es decir, cosas que no sea imposible que sucedan dentro del contexto mencionado. Por ejemplo, si nos referimos a la gravedad de la Tierra, no podemos hacer una definici&oacute;n para "salir explusado hacia el espacio debido a la gravedad". En efecto, no tendr&iacute;a sentido hablar de ello pues nunca ocurre ya que la gravedad siempre nos jala hacia el suelo. Dicha definici&oacute;n puede no tener sentido en dicho contexto (el de la F&iacute;sica) pero puede que en alg&uacute;n otro contexto s&iacute; lo tenga, por ejemplo, en nuestra imaginaci&oacute;n. De tal modo, cuando hablemos de definici&oacute;n matem&aacute;tica no nos referimos a crear nuevos t&eacute;rminos a diestra y siniestra cuando ni siquiera sabemos si tal cosa puede ser posible en nuestro contexto. A eso nos referimos con <i>"debe ser compatible con los dem&aacute;s conceptos del contexto estudiado"</i>.</p>

<p>Como punto final, debe mencionarse que las definiciones no est&aacute;n hechas arbitrariamente. En general, s&oacute;lo es de inter&eacute;s definir aquellas ideas que se repiten com&uacute;nmente en alg&uacute;n contexto o las que son de importancia fundamental para el estudio de algo. Por ejemplo, como el fen&oacute;meno "en que cae agua del cielo" es algo que ocurre muy a menudo, a las personas les interes&oacute; definir la "lluvia". En matem&aacute;ticas s&oacute;lo construimos cosas que s&iacute; necesitamos. Tambi&eacute;n las definiciones pueden ser fundamentales para el estudio de alguna cosa (a esa cosa m&aacute;s adelante la llamaremos <b>teor&iacute;a</b>). Como ejemplo mencionar&iacute;a el concepto de <b>n&uacute;mero</b> en la Teor&iacute;a de N&uacute;meros, &iquest;c&oacute;mo podemos estudiar la Teor&iacute;a de N&uacute;meros sin saber qu&eacute; es un n&uacute;mero?</p>

<p>Un ejemplo m&aacute;s concreto ser&iacute;a definir <b>n&uacute;mero par</b>. Supongamos que sabemos qu&eacute; es un n&uacute;mero,  qu&eacute; significa que un n&uacute;mero sea entero y sabemos dividir. En tal caso, podemos decir que un n&uacute;mero entero es par cuando el resultado de dividir dicho n&uacute;mero entre 2 es otro n&uacute;mero entero. Note c&oacute;mo para poder definir <i>n&uacute;mero par</i> necesitamos saber otros conceptos anteriormente: n&uacute;mero, n&uacute;mero entero y divisi&oacute;n. La delimitaci&oacute;n que le hemos hecho a estos conceptos es <i>"el resultado de dividir dicho n&uacute;mero entre 2 es otro n&uacute;mero entero"</i>. Adem&aacute;s, no hay contradicci&oacute;n con nuestra teor&iacute;a, pues s&iacute; es posible dividir entre 2 y obtener un entero (por ejemplo, 4/2=2, 6/2=3, 10/2=5 o en general cualquier m&uacute;ltiplo de 2). De tal modo, <b>n&uacute;mero par</b> con los conceptos y delimitaciones hechos anteriormente es una definici&oacute;n v&aacute;lida. Lo anterior lo podemos resumir en una tabla:</p>

<table class="tablacentral">
<tr>
<td><b>Conceptos</b></td><td><b>Delimitaciones</b></td><td><b>Contradicciones</b></td>
</tr>
<tr>
<td>N&uacute;mero</td><td rowspan="3">El resultado de dividir un <br> n&uacute;mero entre 2 es entero</td><td rowspan="3">No hay contradicciones, pues los m&uacute;ltiplos de 2 <br> se pueden dividir entre 2 con resultado entero</td>
</tr>
<tr>
<td>N&uacute;mero entero</td>
</tr>
<tr>
<td>Dividir entre 2</td>
</tr>
</table>

<p>Ahora, veamos un ejemplo de concepto mal definido. Pensemos en dividir un n&uacute;mero entre 0. A todos desde la primaria nos han ense&ntilde;ado que la divisi&oacute;n entre 0 no est&aacute; definida. Supongamos que sabemos qu&eacute; es un n&uacute;mero, en especial qu&eacute; son el 0 y el 1, y que sabemos dividir. La delimitaci&oacute;n que haremos para crear esta definici&oacute;n es decir que una divisi&oacute;n tenga al 0 como divisor. "Divisor" es otro concepto que usaremos, con "divisor" nos referimos al n&uacute;mero que divide otro en una divisi&oacute;n, es decir, el n&uacute;mero que est&aacute; abajo de la fracci&oacute;n \( \frac{a}{b} \). Ahora bien, por las propiedades de los n&uacute;meros sabemos que un n&uacute;mero dividido entre s&iacute; mismo es 1, es decir \( \frac{x}{x}=1 \) <b>(P1)</b>. Esto podemos interpretarlo como que un n&uacute;mero s&oacute;lo cabe 1 vez en s&iacute; mismo. Tambi&eacute;n las propiedades de los n&uacute;meros nos dicen que dividir 0 entre cualquier otro n&uacute;mero es 0, esto es, \( \frac{0}{x}=0 \) <b>(P2)</b>, lo cual significa que partir "nada" en <i>x</i> pedazos sigue siendo "nada". Como estas propiedades las tiene cualquier divisi&oacute;n, suponer que est&aacute; definido tomar al 0 como divisor nos lleva a la siguiente contradicci&oacute;n:</p>

$$ 0 = \frac{0}{0} = 1 $$

<p> La primera igualdad (\( 0=\frac{0}{0} \))  se da por la propiedad <b>(P2)</b> mencionada en el p&aacute;rrafo anterior, mientras la segunda (\( \frac{0}{0}=1 \)) se da por la propiedad <b>(P1)</b> que tambi&eacute;n mencion&eacute;. Evidentemente, decir que 0=1 es absurdo, con lo cual vemos que no es posible definir una divisi&oacute;n con divisor 0, es decir, la divisi&oacute;n entre 0 no es bien definida. Veamos la tabla:</p>

<table class="tablacentral">
<tr>
<td><b>Conceptos</b></td><td><b>Delimitaciones</b></td><td><b>Contradicciones</b></td>
</tr>
<tr>
<td>N&uacute;mero</td><td rowspan="5">El divisor de la divisi&oacute;n es 0</td><td rowspan="5">Suponer que existe \( \frac{x}{0} \) nos lleva a que 0=1 <br> de acuerdo con las propiedades de la divisi&oacute;n</td>
</tr>
<tr>
<td>Divisi&oacute;n</td>
</tr>
<tr>
<td>Divisor</td>
</tr>
<tr>
<td>0</td>
</tr>
<tr>
<td>1</td>
</tr>
</table>

<p>Note que si bien la definici&oacute;n de divisi&oacute;n entre 0 no menciona el concepto de n&uacute;mero, es necesario ponerlo pues estamos trabajando con n&uacute;meros (la divisi&oacute;n s&oacute;lo tiene sentido en los n&uacute;meros), con lo cual este concepto lo estamos manejando de manera imp&iacute;cita en el de divisi&oacute;n. Tambi&eacute;n inclu&iacute; el concepto del n&uacute;mero 1 pues lo usamos en la contradicci&oacute;n de la &uacute;ltima columna.</p>

<h3>Otras definiciones mal hechas: la definici&oacute;n circular</h3>
<p>La contradicci&oacute;n con otros conceptos no es la &uacute;nica "definici&oacute;n" mal hecha que podemos encontrar. En ocasiones, puede ocurrir que una definici&oacute;n se llame a s&iacute; misma para definirse. Piensa en lo siguiente: le preguntamos a una persona qu&eacute; es "caerse" y nos responde que "caer" es <i>"cuando se cae algo"</i>. Algo anda mal ah&iacute;, &iquest;no? Es como si quisiera entrar a mi auto y las llaves est&aacute;n dentro. Para recuperar las llaves necesito entrar, pero para entrar necesito las llaves. Observa que para definir algo, necesitamos otros conceptos establecidos, y si definimos algo consigo mismo no estamos usando algo establecido (la propia definici&oacute;n es lo que queremos establecer y por ello es absurdo usarla para definirse).</p>

<p>Otro ejemplo muy parecido al anterior es al que llamaremos <b>definici&oacute;n circular</b>. Ocurre que a veces un concepto para definirse requiere de otro concepto que a su vez depende del primero. Para que entendamos, veamos el siguiente ejemplo. Llegamos a una ciudad de vacaciones y andamos buscando alg&uacute;n lugar representativo de la ciudad (por ejemplo, alguna catedral). Como no sabemos nada de aquella ciudad y andamos perdidos, le preguntamos a un vendedor (le llamar&eacute; Vendedor 1) de comida que encontramos en la calle c&oacute;mo llegar a la catedral. El Vendedor 1 nos dice que no sabe, pero seguro su amigo el Vendedor 2 que se encuentra en la otra calle s&iacute; sabe c&oacute;mo llegar. Entusiasmados, vamos con el Vendedor 2 s&oacuet;lo para escucharle decir que tampoco sabe, pero su amigo el Vendedor 1 s&iacute; y que vayamos a preguntarle a &eacute;l. Como ven, el Vendedor 2 nos manda de redreso con el Vendedor 1 y si regresamos nos mandar&aacute; otra vez con el Vendedor 2, s&oacute;lo para ser regresados nuevamente con el Vendedor 1. Si sigui&eacute;ramos haciendo esto para siempre, estar&iacute;amos actuando circularmente, es decir, dando vueltas sin sentido entre el Vendedor 1 y el 2 y sin obtener la informaci&oacute;n que queremos. Como ven, no es buena idea definir un Concepto 1 usando un Concepto 2 como base y a su vez usando el Concepto 1 para definir al 2.</p>

<p>La primera mala definici&oacute;n podemos verla tambi&eacute;n como una definici&oacute;n circular pero con 1 solo elemento, es decir, no estamos dando vueltas alrededor de 2 conceptos, sino de uno s&oacute;lo. En el ejemplo de los vendedores es como si el Vendedor 1 te mandara consigo mismo para obtener informaci&oacute;n cada vez que lo consultes, pero sin darte informaci&oacute;n, es decir, estar&iaute;s dando vueltas alrededor de Vendedor 1 sin obtener informaci&oacute;n alguna. En efecto, si definimos un Concepto 1 a partir de Concepto 1, requerimos conocer al Concepto 1, lo cual nos lleva a tener que conocer al Concepto 1 nuevamente para poder definirlo, y as&iacute; sucesivamente, dando vueltas y vueltas...</p>

<p>Evidentemente el razonamiento anterior lo podemos generalizar para el n&uacute;mero de conceptos que nosotros queramos. Por ejemplo, un Concepto 1 que requiera conocer un Concepto 2 el cual a su vez requiere del Concepto 3 el cual requiere de un Concepto 4 el cual requiere del Concepto 5 el cual finalmente, para estar bien definido, necesita del Concepto 1, con lo cual regresamos al inicio y estar&iacute;mos dando vueltas indefinidamente entre los 5. En este caso la analog&iacute;a ser&iacute; con 5 vendedores: el Vendedor 1 te manda con el 2, el 2 con el 3, el 3 con el 4, el 4 con el 5 y luego el Vendedor 5 te manda de regreso con el 1. Por tanto, siempre que queramos armar una buena definici&oacute;n, necesitamos verififcar que no estemos dando vueltas entre las definiciones involucradas. Dar&eacute; pues, una definici&oacute;n para "definici&oacute;n circular" bas&aacute;ndome en lo anterior:</p>

<div class="definition">
<b>Definici&oacute;n 0.0.1: <i>Definici&oacute;n circular</i></b>
<p>Sean \( c_1,c_2,...,c_n \) conceptos abstractos. Decimos que que estos conceptos forman una definici&oacute;n circular si \( c_1 \) requiere de \( c_2 \) para definirse, \( c_2 \) requiere de \( c_3 \) y as&iacute; sucesivamente hasta \( c_n \), pero \( c_n \) requiere de \( c_1 \) para estar bien definida. Una definici&oacute;n circular no es una definici&oacute;n v&aacute;lida.</p>
</div>

<p>La situaci&oacute;n anterior la podemos ver gr&aacute;ficamente en la siguiente imagen:</p>
<!--Imagen de un ciclo de definiciones, es decir, una definicion circular-->

<h3>Definiciones infinitas: la analog&iacute;a del diccionario</h3>
<p>Con todo lo anterior debe estar m&aacute;s que claro que las definiciones necesitan de otros conceptos abstractos para definirse. Luego, estos conceptos necesitan a su vez de otros conceptos para estar definidos tambi&eacute;n, y estos a su vez requieren de m&aacute;s conceptos para definirse... Piensa en esto como un diccionario: escoge la palabra que quieras y busca su significado. El diccionario nos dar&aacute; otras palabras para definir su significado. Ahora, busca el significado de alguna de estas palabras en el mismo diccionario. Evidentemente, nos llevar&aacute; a otra definici&oacute;n la cual requiere de m&aacute;s palabras. Si escogemos alguna de estas palabras y buscamos nuevamente su significado, llegaremos a una nueva definici&oacute;n en la cual encontraremos m&aacute;s palabras. Podemos repetir este proceso buscando el significado de alguna palabra en la &uacute;ltima definici&oacute;n que tengamos, con lo cual surge una pregunta muy natural: &iquest;hay alg&uacute;n final para el proceso anterior? Veamos el siguiente ejemplo:</p>

<table class="tablacentral">
<tr>
<td><b>Concepto</b></td><td><b>Concepto requerido</b></td>
</tr>
<tr>
<td>Cueva</td><td>Caverna</td>
<tr>
<td>Caverna</td><td>Hueco</td>
</tr>
<tr>
<td>Hueco</td><td>Espacio Abierto</td>
</tr>
<tr>
<td>Espacio Abierto</td><td>Abierto</td>
</tr>
<tr>
<td>Abierto</td><td>Sin bordes</td>
</tr>
<tr>
<td>Sin bordes</td><td>Borde</td>
</tr>
<tr>
<td>Borde</td><td>L&iacute;nea</td>
</tr>
<tr>
<td>L&iacute;nea</td><td>Marca</td>
</tr>
<tr>
<td>Marca</td><td>Señal</td>
</tr>
<tr>
<td>Señal</td><td>...</td>
</tr>
</table>

<p>Las palabras anteriores las obtuve buscando el significado de cada palabra en el diccionario de Google. Observe que empezamos buscando el significado de "cueva" y para ello necesitamos saber qu&eacute; es "caverna". Para definir "caverna", requerimos saber qu&eacute; es un "hueco", para "hueco" necesitamos "espacio abierto" y as&iacute; sucesivamente. Note que si seguimos haciendo lo anterior, el proceso nunca terminar&iacute;a, pues cada palabra que encontremos la seguir&iacute;amos definiendo... Incluso podemos llegar a las palabras m&aacute;s profundas del pensamiento: los verbos "ser", "estar" y "hacer" e intentar buscar algo m&aacute;s profundo para definirlas, y despu&eacute;s buscar algo a&uacute;n m&aacute;s profundo para definir lo anterior, etc.</p>

<p>Con el razonamiento anterior, nos damos cuenta que no todo puede ser definido: en efecto, si todo fuera definido podr&iacute;amos hacer una cadena infinita como la mencionada en el p&aacute;rrafo anterior, lo cual es absurdo pues para definir algo necesitamos de un concepto que ya est&eacute; establecido y como la cadena es infinita no hay alg&uacute;n concepto bien definido ya que no hay un principio (la cadena se extiende infinitamente y eso significa que nunca hay un comienzo). Piensa que esto es un edificio: no podemos contruir sin los cimientos. Si tuvi&eacute;ramos infinidad de pisos hacia abajo jam&aacute;s llegar&iacute;amos a los cimientos y por tanto no podr&iacute;a existir el edificio.</p>

<p>De tal modo, requerimos de alguna base para poder definir todo lo dem&aacute;s a partir de ello. Es decir, buscar&iacute;amos algun concepto cuyo significado sea tan, pero tan obvio que no necesite ser definido. Por ejemplo, el verbo "ser" en el idioma, tiene un significado tan esencial en nuestro lenguaje que no solemos definirlo. Cuando alguien nos dice "ser profesor", "ser cient&iacute;fico", "ser f&iacute;sico" entendemos perfectamente a qu&eacute; se refieren, aunque no podamos definir qu&eacute; significa "ser". Simplemente es un verbo tan claro que lo entendemos de manera impl&iacute;cita sin que alguien nos tenga que explicar su significado. A estos conceptos base que no requieren ser definidos y de los cuales partir&aacute;n las dem&aacute;s definiciones y conceptos posibles, los llamaremos <b>Conceptos primitivos</b> o <b>Conceptos no definidos</b>.</p>

<div class="definition">
<b>Definici&oacute;n 0.0.2: <i>Concepto no definido o Concepto primitivo</i></b>
<p>Un concepto es primitivo si no requiere de alg&uacute;n otro concepto para definirse.</p>
</div>

<p>Por lo explicado en el p&aacute;rrafo anterior, es claro que necesitamos de conceptos no definidos en cualquier teor&iacute;a, pues si no llegar&iacute;amos a una cadena infinita de definiciones. Los conceptos primitivos son obviamente el principio de la cadena, es decir, si escogemos cualquier concepto y buscamos su significado, luego buscamos el significado de alguno de los conceptos obtenidos en la definici&oacute;n del primer concepto y as&iacute; sucesivamente, nuestra cadena terminar&iacute;a en un concepto primitivo. Por definici&oacute;n de concepto primitivo, ya no podemos definirla a partir de otros conceptos, con lo cual debemos asumir impl&iacute;citamente su significado. Recuerda que algunas cosas como el verbo "ser" no pueden ser definidas, pero entendemos de manera natural su significado.</p>

<p>Como &uacute;ltimo ejemplo, imagina que estamos estudiando a la humanidad, es decir, a las personas. Tendr&iacute;amos que proponer alg&uacute;n concepto no definido. Por razones obivas, escogeremos como primitivo el concepto de "persona". Todos sabemos qu&eacute; es una persona, sin embargo, podemos no definirlo y dar por hecho que conocemos su significado. A partir de "persona" ya podemos definir otros conceptos como "mujer", "hombre", "ni&ntilde;o", "soltero" y muchos conceptos m&aacute;s.</p>
<p>Nota que en las definiciones anteriores, como la <i>definici&oacute;n</i> de "definici&oacute;n" (insisto, eso en realidad <b>no fue una definici&oacute;n</b>) o la de "definici&oacute;n circular", as&iacute; como la de "concepto primitivo", nosotros usamos como concepto preliminar la noci&oacute;n de "concepto". &iexcl;As&iacute; es! Para definir todo lo anterior debemos dar por hecho que sabemos qu&eacute; es un "concepto". Luego, sabiendo eso, ya podemos decir qu&eacute; es una "definici&oacute;n". Como consecuencia de todo lo anterior, podemos decir que un "concepto" es un concepto primitivo. De igual forma, cuando mencionamos las "entidades abstractas" en la introducci&oacute;n de este tema, dimos por hecho que sabemos qu&eacute; son, es decir, tambi&eacute;n podemos considerarlas conceptos primitivos.</p>
</section>


<section>
<h3>Conclusi&oacute;n del Principio</h3>
<p>Aqu&iacute; es donde termina nuestra primera lecci&oacute;n acerca de matem&aacute;ticas, pero tambi&eacute;n es aqu&iacute; donde empieza nuestro largo e infinito camino a trav&eacute;s del conocimiento. Para quien haya logrado superar todo y llegar a esta parte, debo confesar algo: los temas expuestos en ep&iacute;grafes anteriores rayan m&aacute;s en lo filos&oacute;fico que en lo matem&aacute;tico. Pero hay que recordar, que los primeros grandes matem&aacute;ticos reconocidos por la historia fueron tambi&eacute;n fil&oacute;sofos, con lo cual vemos que estas 2 disciplinas est&aacute;n &iacute;ntimamente ligadas.</p>
<p>Como comentario final, les recordar&eacute; que es primordial saber qu&eacute; es una definici&oacute;n, al menos en el contexto de las matem&aacute;ticas, ya que con ello podremos "ponernos de acuerdo" para decir qu&eacute; es cada concepto dentro de las matem&aacute;ticas. Bien, eso es todo querido p&uacute;blico, espero les haya gustado lo que leyeron. No dejes de visitar este sitio constantemente, que pronto subir&eacute; nuevos temas que podr&iacute;an interesarte. Cualquier duda o comentario me lo puedes mandar en el formulario del final de esta p&aacute;gina. &iexcl;Hasta pronto!</p>
<!--Poner la imagen de algun matematico con una frase profunda acerca de las matematicas-->
</section>


<div id="cambiopags"><b>Ir a otros temas</b><br>
<a href="javascript: alert('El tema a\u00FAn no ha sido publicado. No dejes de vistarnos, pronto subiremos nuevo contenido.');" title="Siguiente tema" rel="next">&#9658;</a></div>
</article>

<!--Paginas recomendadas-->
<aside>
<h3>Friki Cueva</h3>
<a href="https://droidroar369.github.io/friki-cueva/" title="Main Page" rel="author">  <img src="../images/mrC.png" width="128px" height="128px" alt="Logo de FrikiCueva">  </a>
<p>Enjoy this site!!!</p>


<h3>Droid Roar</h3>
<a href="https://www.youtube.com/@droidroar" title="YT/Droid Roar" rel="author"> <img src="../images/logo01.png" width="128px" height="128px" alt="Logo de Droid Roar"> </a>
<p>Visit my YT channel!!!</p>


<h3>Dark Roar</h3>
<a href="https://www.youtube.com/@darkroar369" title="YT/Dark Roar" rel="author">  <img src="../images/dark-logo01.png" width="128px" height="128px" alt="Logo de Dark Roar">  </a>
<p>Also visit my Dark YT channel!!!</p>

</aside>




<!--Pie de pagina-->
<footer>
<h3>Autor y copyright</h3>
<p>Friki Cueva/Droid Roar &copy; 2023 Copyright. You can copy the information and images within the page, but quote us when you use it. I will thank you for that. :)</p>
<script type="text/javascript">
document.write('<b>Ultima modificacion: '+window.document.lastModified+'</b><br />');
</script>
<a href="#arriba" title="Ir arriba">Ir arriba</a><br />
</footer>


</body>
</html>

